using System.Text;

Console.InputEncoding = Encoding.UTF8;
Console.OutputEncoding = Encoding.UTF8;

Console.WriteLine("Привіт козаки і козачки!");

//Як оголосити і стоврити змінні
int a = 10; //Так само, як С++ - 4 байта
Int32 b = 12; // Це так само, як int - 32 біта

int c = a + b; //Додавання двох змінних //Все як у С++
Console.WriteLine("С = " + c);

//Давайте зробимо групування типів даних
//Цілі числа - byte - 1 байт, sbyte;
byte d = 255; // Додатній максисмум 1 байт
sbyte s = 127; //1 байт максимуму 127
sbyte s1 = -128; // мінімуму 

short my_s = 32767; //Розмір - 2 байта - 16 біт - додатні і відємні числа
my_s = -32768; //мінімальне число
ushort my_us = 65535; //2 байти лише додатні числа - 2 байти
ushort b3 = 13100; //Даного типу вистачить - 65535
//максимум в int - 2147483647
int myInt = 2147483647; //Тип 4 байта - 32 біта - 2^32 - 2 147 483 648
myInt = -2147483648; // Це мінімум
// uint - лише додатні числа 4 байти - максимум  4 294 967 296

//Наступний long - 8 байт - 64 біта - додатні і відємні 
//ulong - тільки додатні 8 байт - 64 біта.

//Дробові типи - flaot, double, decimal
//float - 4 байта
//double - 8 байт 
//decimal - зберігання фінансів. - 16 байтів

//Символи - char - зберігаємо символи - 2 байти - 65535 - розмір таблиці кодування
//Тобто у C# автоматично працює можливість зберігання тексту на усіх мовах
//Так як у С++
//Для масиву зробили String
String str = "Класна сьогодні погода :)";
Console.WriteLine(str);










